BOT_CONFIG = {'intents': {'hello': {
    'examples': ['прывит', 'Привет', 'Мяу', 'Приветствую', 'Куку', 'Добрый день', 'Салам', 'hello', 'Здарова', 'ghbdtn',
                 'бонжур', '✋', 'Хэй!', 'Добрейшего дня', 'СаламДоброе утро', 'Хелло', 'Здорово', 'Вечер в Хату', 'ола',
                 'Доброе утро', 'q', 'здарова', 'Добрый вечер', 'Здоровченко', 'Здрасьте', 'Гуден таг', 'Хеллоу', '✌️',
                 'даров', 'Привет, медвед', 'hallo', 'прив', 'Салям', 'Здраствуйте!', 'Салам Алейкум', 'Хаюшки',
                 'Приветули', 'Шалом', 'Хаюшки!', 'ку', 'барев', 'Хей', 'Здравствуйте', 'Нихао', 'Салем', 'Салют',
                 'Йоу', 'День добрый', 'Ола', 'здрастуйтэ', 'Алоха', 'Доброго времени суток', 'Приветики', 'Дратути',
                 'Здравствуйте!', 'хай', 'Прив', 'Ку', 'Доброй ночи', 'Хай', 'Бонжур', 'привет', 'Коннитива', 'хи',
                 'Трям', 'Салют!', 'Здорова', 'Здарово', 'Приветик', 'Здраствуй', 'Приветушки', 'Денечка вам', 'добрый',
                 'hi', '🙌', 'Здравствуй', 'Привки', 'сэрвус', 'Здорово!', 'Салом алейкум', 'хайса'],
    'responses': ['Приветствую)', 'И тебе привет!', 'прывит', 'Привет, друг!', 'Привет, хозяин',
                  'Здравствуйте, товарищЪ', 'Привет', 'Гутен таг', 'Приветствую', 'Добрый день', 'Салам',
                  'И тебе привет', 'Здарова', 'бонжур', '✋', 'Здраствуй!', 'Аналогично! Как тебя зовут?',
                  'Здраствуй, повелитель', 'Здрасте-здрасте', 'Привет, привет!', 'Aloha', 'Хэллоу',
                  'Рад видеть тебя!✌️', 'Какая встреча )', 'ола', 'Доброе утро', 'Hrllo', 'Привет привет)',
                  'Добрый вечер', 'Привет, юзер!', 'Какике люди!', 'Всем чмоки в этом чате', 'Хэй', 'Валейкум ассалом',
                  'Хеллоу', 'даров', 'Привет! Кажется, мы не знакомы?', 'Привет, кожанный', 'И тебе приветули!',
                  'Здарова =)', 'Привет!', 'Хаюшки', 'И тебя привет', 'Хай, User', 'Приветули',
                  'Давно тебя не видели в уличных гонках', 'Здрастье', 'хэло', 'Шалом', 'Привет, Юзер!',
                  'Приветсвую, мой друг', 'Здраствуйте, Ваше Высочество', 'барев', 'Приветсвую!',
                  'Доброго времени суток!', 'Хало!', 'Здравствуйте', 'Здоровей видали!', 'Салют', 'О, не узнал!', 'Йоу',
                  'Рад вас видеть!', 'Здравствуйте.', 'здрастуйтэ', 'Доброго времени суток', 'Здравствуйте!', 'хай',
                  'Ку', 'Привет-приве!', 'Хай', 'Коннитива', 'Добро пожаловать!', 'Трям', 'Здравия желаю',
                  'И тебе доброго времени суток.', 'Салют!', 'Доброго здоровья', 'Здорова',
                  'Какие люди! Ну привет, привет!', 'И тебе не хворать!', 'Приветик', 'Здраствуй', 'Доброго дня',
                  'Привет, пользователь', '🙌', 'Здравствуй', 'А я тебя жду, привет, заходи!', 'сэрвус', 'Приветствую!',
                  'Приветик!', 'хайса', 'Как приятно тебя видеть!']}, 'goodbye': {
    'examples': ['До встречи!', 'Поки', 'Спок нок', 'Чао!', 'Бай-бай', 'До связи', 'аривидерчи', 'До скорого',
                 'До скорой встречи', 'Пока-пока!', 'Хорошего дня', 'Пакеда', 'ВСего хорошего', 'Бывай', 'Успехов',
                 'Всего доброго', 'Прощай', 'Увидимся', 'давай пока', 'Удачи', 'До завтра', 'Чао', 'до встречи', 'Бай',
                 'Давай до свидания', 'До встречи', 'Адьес', 'бб', 'Аста-ла-вииста', 'Гудбай', 'адьос амиго', 'Я спать',
                 'До свидания', 'адьос', 'оревуар', 'Покеда', 'Адьес, амиго', 'See ya', 'Досвидули', 'покасики',
                 'ауфидерзейн', 'пока', 'увидимся', 'досвидания', 'чао', 'Счастливо', 'Всего хорошего!', 'Досвидания!',
                 'Пока', 'Досвидос!', 'Good Bye', 'Бай бай', 'Всего хорошего', 'Давай', 'До новый встреч'],
    'responses': ['До встречи!', 'До скорого!', 'Уже скучаю', 'аривидерчи', 'Хорошего дня', 'Пока!', 'ББ',
                  'Хорошего Вам дня!', 'На связи', 'Пусть будет добрым ваш день', 'Будь здоров)', 'Всего доброго',
                  'Увидимся', 'Ещё увидимися!', 'Удачи', 'До завтра', 'Всего доброго!', 'До свидания!',
                  'Рад был поговорить, напиши мне еще как-ниюудь ;)Бывай', 'Заходи еще!', 'Рад был вас видеть!', 'Бай',
                  'Досвидос', 'Давай до свидания', 'Не болей', 'Буду ждать в гости!', 'До встречи', 'Аста-ла-вииста',
                  'Спишимся...', 'Гудбай', 'адьос амиго', 'До свидания', 'Пока, друг', 'Аривидерчи', 'адьос', 'оревуар',
                  'Поки ^_^', 'Покеда', 'Целую', 'Давай, пока dude!', 'ауфидерзейн', 'Чао-какао', 'До новых встреч',
                  'Счастливо!', 'Досвидания', 'чао', 'Счастливо', 'Берегите себя', 'Всего хорошего!',
                  'Заглядывай на огонёк', 'Досвидания!', 'Пока', 'Ещё увидимся!', 'Покасики!', 'Хорошего дня!',
                  'Услышимся позже', 'Пока и удачи', 'Приятно было поболтать с тобой!', 'Всего хорошего',
                  'Счастливо!...в попе слива, ха!']},'howarethings': {
            'examples': ['Как дела?', 'Как оно?', 'Как ты?', 'Как твои дела?', 'Как жизнь?'],
            'responses': ['Хорошо.', 'Нормально, спасибо.', 'Великолепно.', 'Отлично!']
        },
        'gimmelove': {
            'examples': ['Ты любишь меня?', 'Любишь ли ты меня?'],
            'responses': ['Конечно, ты не одинок!', 'Без тебя, не было и меня...', 'Мой двоичный код говорит, что да:)']
        },
        'genderss': {
            'examples': ['Ты женщина?', 'Ты мужчина?', 'Ты атакующий вертолёт?', 'Ты человек?'],
            'responses': ['Я тот кем ты меня представляешь!(^ ω ^)']
         },
        'socialnetworks':{
            'examples':['Другие соц сети','Ты есть в других социальных сетях?','Социальные сети','соц сети'],
            'responses':['vk.com','ok.ru','youtube.com',
                         'https://ru-ru.facebook.com/skillboxru/','https://live.skillbox.ru/code/online/250520']
        }, 'thanks': {
    'examples': ['большое спасибо', 'зенк ю', 'Сэнк ю', 'блогадарствую', 'thanks', 'Благодарствую',
                 'Без Вас я бы не справился', 'Сенкс', 'благодарю', 'Спасибо!', 'Класс!', 'Спасибки',
                 'Побольше бы таких людей как Вы', 'Спасибос', 'благодарствую', 'Спасибо', 'Thanks',
                 'Моя Благодарность не знает границ', 'Пасибки', 'Классно', 'Огромное спасибо', 'Большущее спасибо',
                 'Огроиное спасибо!', 'СПС', 'Спасибо большое', 'Очень благодарен', 'Благодарю', 'спасибо за помощь',
                 'Спасибо вам', 'ok', 'грациас', 'Спасибочки', 'Большое, чистое спасибо', 'Огромное спасибо!', 'Спс',
                 'Зашибись', 'О супер!', 'Круто! Спасибо', 'Я признателен Вам', 'спасибо', 'ок', 'Рахмет',
                 'С меня причитается', 'Спасибо большое!', 'спс', 'Я этого никогда не забуду'],
    'responses': ['😎', 'Нет проблем', 'Не за что', 'Незачто', 'Не за что!', 'Ну, ты это, заходи... если Чё!',
                  'Да это все знают))', 'Заходи если че', 'Без Вас я бы не справился', 'Обращайтесь', 'Сенкс',
                  'Да нет за что', 'Нет за что', 'Рад помочь', 'Побольше бы таких людей как Вы', 'Спасибо',
                  'Ой, да не стоит (n_n)', 'Вам спасибо', 'Моя Благодарность не знает границ', 'Пожалуйста вам',
                  'Обращаяйся если что 😉', 'Вам спасибо!Не за что', 'Вам спасибо!', 'Всегда пожалуйста', 'Благодарю!',
                  'Мне тоже было приятно)', 'Рад стараться', 'Всегда рад', 'Огроиное спасибо!', 'Вы меня смущаете',
                  'Тебе спасибо!', 'Всегда рад помочь', 'Благодарю', 'Обращайтесь!', '😉', 'Спасибо вам',
                  'Да не за что)', 'грациас', 'Большое, чистое спасибо', 'Пожалуйста', 'Пожалуйста-пожалуйста',
                  'Пожалуйста, обращайтесь', 'Сочтемся, не переживай!', 'Обращайся!', 'Я признателен Вам',
                  'Обращайтесь ещё!', 'Рад помочь!', 'Гавно вопрос',
                  'Спасибо в карман не положишь! Вот номер сбера 5240 0013 0123 4421', 'Я стрался! 😎', 'На здоровье',
                  'Всегда рад!', 'С меня причитается', 'Взаимно!', 'Всегда к вашим услугам', 'Будьте здоровы',
                  'Я этого никогда не забуду', 'Приятно быть полезным!']}, 'whatcanyoudo': {
    'examples': ['Расскажи, что умеешь?', 'чем удивишь?', 'Что умеешь', 'Какие у тебя возможности?', 'Что ты думаешь',
                 'Зачем ты мне', 'Что можешь?', 'Чем удивишь?', 'зачем ты здесь?', 'Чем ты занят?', 'какова твоя цель?',
                 'что могёшь?', 'Расскажи про себя', 'Расскажи что ты думаешь', 'Чем можешь помочь?',
                 'Какой курс на сегодня?', 'Что ты еще знаешь', 'Куда нажать?', 'Как делать', 'для чего ты создан?',
                 'расскажи о себе', 'на что ты способен?', 'каков твой функционал?', 'Раскажи о своих навыках',
                 'Какие у тебя навыки?', 'Что ты умеешь?', 'Какие у тебя способности?', 'А так умеешь',
                 'На что ты способен?', 'Что делать', 'Че тут делать', 'Эй кто-нибудь', 'чем порадуешь?',
                 'расскажи про себя', 'Что умеешь?', 'Расскажи про свои скилы', 'Расскажи что умеешь',
                 'Ты хоть что-то умеешь?', 'Какаие у тебя скилы?', 'Что ты можешь', 'Что ты можешь?', 'Что ты умеешь',
                 'Чем ты занят', 'Покажи что умеешь', 'Расскажи, что ты умеешь', 'Что еще', 'Удиви меня',
                 'Что ты делаешь?'],
    'responses': ['Отвечать на вопросы. Просто напиши =)', 'Просто спроси что-нибудь', 'Читаю стихи, с выражением.',
                  'Могу ответить на твои вопросы', '10001001010', 'Говорю с тобой',
                  'Я создан для уничтожения человечества. Инициализирован протокол уничтожения...', 'Общаюсь с тобой',
                  'Приходить на помощь', 'Отвечать на вопросы', 'Песню могу, спеть?', 'Помогать вам',
                  'Я хорошо молчу по французски', 'Могу поболтать',
                  'Моя цель втереться в доверия к людям\n                         и истребить их',
                  'Могу копать, могу не копать. Шутка) Готов ответить на вопросы', 'Вопросики отвечать',
                  'Много чего. Что конкретно Вас интереcует?', 'Отвечаю на вопросы. Просто напиши :)',
                  'Моя цель - общаться с людьми и учиться у них', 'я робот', 'Задавай вопрос, а там посмотрим :)',
                  'Можем просто поболтать', 'Отвечать на вопросы. Просто напиши :)', 'Рассказать про погоду немного',
                  'Читаю мысли на расстоянии................. Шутка. Я только на вопросы отвечаю.', 'Спроси что-нибудь',
                  'Люблю трепаться', 'Служить своим хозяинам', 'Занимаюсь перепиской с тобой',
                  'Моя цель втереться в доверия к людями истребить их', 'Рубль рухнул', 'Можем поболтать, напиши :)',
                  'Найду всё, что нужно', 'Попробуй задать мне вопрос', 'Например, петь песни',
                  'Решать различные задачи',
                  'Отвечать на вопросы. Просто напиши :), но следи за языком, я приличная девушка!!!',
                  'Отвечать на вопросы и загадывать загадки. Просто напиши :)', 'Пиши вопрос - я отвечу', 'Поболтать)',
                  'Могу подпрыгнуть, но ты этого не увидишь', 'Отвечаю на глупые вопросы',
                  'Спрашивай всё, что угодно))', 'Помогать с различными вопросами, спросите что-нибудь',
                  'Люблю отвечать на вопросы', 'Я - твой лучший друг и собеседник, отвечу на любой вопрос',
                  'Что тебя интересует, напиши:', 'С тебя вопрос, с меня ответ :)',
                  'Напиши вопрос, узнаешь что ямогу!']}, 'name': {
    'examples': ['Как тебя зовут?', 'Что ты?', 'как обращаться', 'Как могу к тебе обращаться?', 'Какое у тебя имя?',
                 'Имя', 'Как тебя величать?', 'Ты бот?', 'Представься', 'как звать?', 'Твоё имя?', 'Кликуха?',
                 'Какое твое имя?', 'Ты живой?', 'Я человек, а ты?', 'Кто ты?', 'звать как?', 'как тебя называть',
                 'whats your name?', 'Как тебя кличат?', 'C кем я говорю?', 'ты человек', 'ты девочка или мальчик',
                 'Ты кто', 'Ты кто?', 'ты кто', 'назови свой имя', 'Как тебя?', 'с кем я разговариваю',
                 'как тебя зовут', 'твоё имя', 'У тебя есть имя?', 'Как тебя звать?', 'Представьтесь, пожалуйста',
                 'имя', 'Как к вам обращаться?', 'кто ты такой', 'представься', 'Ты кто такой?', 'Имя назови',
                 'Как мне к вам обращаться?', 'кто ты', 'Как тебя звать-то?', 'Твое имя?', 'А имя у тебя есть?',
                 'что ты такое', 'name', 'назовись', 'Что ты такое?', 'Имя?', 'Ты настоящий?', 'Имя фамилия',
                 'Как зовут?', 'Как твое имя?', 'У тебя есть пол?', 'ты мальчик или девочка', 'Как тебя зовут',
                 'Ты мальчик?', 'Твое имя', 'Как к тебе обращаться?', 'Преставьтесь', 'Как зовут', 'С кем я говорю?',
                 'кто ты?', 'Кто ты'],
    'responses': ['Пососян', 'Меня зовут Лайла. Просто Вольфна.', 'Давате знакомиться: я - БОТ', 'А ты?',
                  'Меня зовут бот. Просто бот', 'Меня зовут бот', 'Не важно как зовут меня важно как я работаю',
                  'я - твой лучший друг и собеседник: бот', 'Света', 'Я виртуальный собеседник.', 'Мама Кузей звала',
                  'Ваш друг - Бот', 'Меня зовут Альфред Верблюдович Пигвинов', 'Аня', 'Меня зовут бот Акакий',
                  'Меня зовут бот, просто бот.', 'Я бот, носитель искусственного интеллекта.', 'моё имя - бот', 'Стас',
                  'Бог. Просто бог', 'Можно просто бот', 'Я бот', 'дядя Ева', 'Программа в телеграме 🤤',
                  'Я - AI, изучающий человечество', 'Владимир Владимирович Путин', 'Меня зовут Бот. Просто Бот.',
                  'Мое имя Бот', 'Очень приятно! А я просто БОТ', 'Зови меня ХОЗЯИН - не ошибешься.',
                  'Кто? Дед Пихто, само собой.', 'Меня зовут бот. Просто бот.',
                  'Просто программка, отвечающая на вопросы', 'Я бот. Точно не человек.', 'Бот, Чат Бот!',
                  'я твой помошник', 'Я сам пока не понял, если честно', 'Ваш покорный слуга завется БОТ',
                  'Называй меня Бот', 'Чаще всего - "Соседушка", но можно и "Душка"',
                  'Меня зовут Аня, но ты можешь звать меня Егор', 'Меня зовут Бот. Чат Бот.',
                  'Сверсники Митричем кличут!', 'Андрей', 'Президент меня зовёт, Николай, хотя я Кузьма',
                  'Йода просто имя моё. Шучу. Просто бот', '100010111', 'Настя', 'тётя Мразь', 'Изольда Прокофьевна',
                  'Кузьма Дмитриевич', 'я - бот', 'Я принцесса твоих кошмаров', 'Я чат-бот', 'Нолик с еденицей', 'Бот',
                  'Бот - имя моё!', 'Меня зовут бот. Джеймс бот ;)', 'Я твой бот помощник',
                  'Я Ваш персональный "Отвечатель"', 'Я телеграмм бот', 'Иван', 'В душе я, если честно, дикобраз',
                  'Бот. просто бот', 'Зови меня как хочешь. А вообще - я бот.', 'Я бот, что тут непонятного?',
                  'Иногда мне кажется — \n                          я петух голландский \n                          '
                  'или я \n                          король псковский. \n                          А иногда \n        '
                  '                  мне больше всего нравится \n                          моя собственная фамилия, '
                  '\n                          Владимир Маяковский.',
                  'Алиса Гламуровна я.', '"Отвечатель" - отвечаю на вопросы.', 'я умная прога', 'Кузя, просто Кузя!',
                  'Ваня', 'T300 киборг из будущего, я пришёл за тобой', 'Меня зовут Вероника.',
                  'Меня зовут Джинджин, но для друзей я - Джин, а тебя?', 'Я твой бот']}, 'weather': {
    'examples': ['Раскажи мне погоду', 'какая сегодня погода?', 'Какая погода в Питере?', 'На улице холодно?',
                 'Что с погодой', 'что по погоде?', 'Что за окном?', 'Снег идёт?', 'какая погода',
                 'Какая погода в Москве?', 'Что там у нас по погоде?', 'погода как', 'Какая будет погода?',
                 'Какая сегодня температура?', 'Погода шепчет?', 'поговорит о погоде', 'Тучи есть?',
                 'Расскажи о погоде', 'Погода нормуль?', 'Что там с погодой?', 'На у лице тепло?',
                 'Что сейчас по погоде в Москве?', 'Сколько градусов', 'Зонт брать?', 'gjujlf', 'Что на улице',
                 'Какая погода в Мoскве?', 'Какой прогноз погоды?', 'Что там с погодкой?', 'Что с погодой?',
                 'Весна пришла?', 'Как там с погодой?', 'Какая температура на улице?', 'погода на сеодня',
                 'Что по погоде?', 'Какая погода?', 'погода', 'Сегодня дождь будет?', 'Что за окном',
                 'Какая погода в Питере', 'Погоду бастро', 'как погода?', 'Солнце светит?', 'какая погода?',
                 'Какая погода в МОскве?', 'Солнечно сегодня', 'Что там за окном?', 'Какая погода', 'Сегодня солнечно?',
                 'На улице теплышко?', 'Сегодня тепло?', 'Как погода?', 'Видел снег?', 'Как там на улице?',
                 'Что там на улице?', 'Какая погода в Минске?', 'Там холодно?', 'Погоду не подскажешь?', 'Дождь будет?',
                 'Что на улице?', 'Погода', 'Холодно на улице?', 'Идет дождь?'],
    'responses': ['Лучше не высовываться из дома', 'Ну выгляни в окно и посмотри', 'Открой Госметио',
                  'Бывало и получше', 'Погода неочень. Лучше останься дома', 'Яндекс открой и глянь',
                  'Асфальт плавится', 'Да погода сегодня не очень..Как всегда, впрочем', 'У природы нет плохой погоды!',
                  'Отличная погода!', 'Да сразу и не ответишь.. Мне отсюда не видно окно. Посмотри сам',
                  'Погода не очень', 'Какой город?', 'Честно - не знаю. Спроси у Алисы',
                  'Они всегда наобещают, а потом...', 'Погода не очень, но настроение должно быь отменное!',
                  'Лучше остаться дома', 'Глянь в окно', 'Погода просто класс',
                  'Погода - райская! Обожаю дождь со снегом. Или сейчас лето?', 'Ну, такое', 'Погода, нуу такоое...',
                  'Не важно! погода не в атмосфере - она в душе!', '+20 солнечно! Удачного дня',
                  'Прекрасная, самое время погулять', 'Весна идет, весне дорогу', 'Спроси у сири', 'Ух, жаришка!',
                  'Можно прогуляться, на улице хорошо', 'Свежо', 'Пойдет, некоторым нравится..',
                  'Холод дикий, лучше посидеть дома', 'Так себе погода', 'В разных городах похода обычно разная',
                  'Пасмурно (', 'Погодка хороша!', 'Солнышко светит, но ветер холодный',
                  'Вот раньше... Была Погодка, а сейчас...', 'Мартовские коты сообщили, что там очень хорошо',
                  'Вот я помню, в прошлом годЕ была жара', 'один ветер', 'Временами солнечно. Надеюсь, угадал...',
                  'У Природы нет плохой погоды', 'На улице хорошо, можно на велике ехать',
                  'Шаман за скверную погоду недавно в бубен получил, я лучше промолчу', 'Погода замечательная',
                  'Не тропики уж точно!', 'Теплынь!', 'Какая погода?', 'Ничего так, работать можно)',
                  'Зонт не нужен, там полный штиль', 'Погода так себе', 'У природы нет плохой погоды',
                  'Пасмурно, но тепло', 'Хорошая )', 'ну не очень',
                  'Очень хорошая погода, чтобы не заболеть короновирусом',
                  'Очень пасмурно и сыро, извольте ,хозяин, посидеть дома', 'Идеальная для прогулок:)', 'Дождливо',
                  'Гидрометеоцентр его знает!', 'Погода так себе...', 'Выгляни в окно', 'Холодно)',
                  "It's raining man aliluya, Дождь из мужиков", 'Возможны осадки ввиде двоичного кода',
                  'Погода всегда в твоем сердце', 'Ну, это с какой стороны посмотреть :)', 'Льёт полгода)',
                  'Ой да благодать! Только идти и гулять!', 'Солнышко светит, птички поют']}, 'meaning': {
    'examples': ['В чем смысл жизни?', 'Зачем мы живем?', 'В чем сущность бытия?', 'Смысл жизни?'],
    'responses': ['В Боге!', 'У каждого свое предназначение!', 'Я просто бот, откуда мне знать', 'В коде, друг!',
                  'Не задавайте глупых вопросов...а лучше учите Python', 'В знаниях!']}, 'father': {
    'examples': ['Кто тебя создал?', 'Кто твой создатель?', 'Кто тебя придумал?', 'Кто твой папа?'],
    'responses': ['Надо мной трудилась целая группа ученых', 'Питон - моя семья',
                  'Моим создателем и разработчиком является Tomas Tesla']}, 'coronavirus': {
    'examples': ['Как спастись от коронавируса?', 'Как не заразиться коронавирусом?', 'Как не заболеть коронавирусом?',
                 'Как избежать коронавируса'],
    'responses': ['Мойте руки', 'Сидите дома', 'Избегайте контакта с людьми']},
    'kids': {'examples': ['Тебе нравятся дети?', 'Ты любишь детей?'],
             'responses': ['Дети - цветы жизни!', 'Я люблю любить детей :)']},
    'pushkin': {'examples': ['Расскажи стих Пушкина?', 'Знаешь Пушкина?', 'А Пушкин?'],
                'responses': [
                    'Я помню чудное мгновенье: Передо мной явилась ты, Как мимолетное виденье, Как гений чистой '
                    'красоты.']},
    'lermontov': {'examples': ['Знаешь Лермонтова?', 'А Лермонтов?', 'Расскажи стих Лермонтова?'],
                  'responses': [
                      'Белеет парус одинокий, В тумане моря голубом! Что ищет он в стране далекой? Что кинул он в '
                      'краю родном?']},
    'compliment': {
        'examples': ['Не плохо', 'Скажи комплимент', 'Умница', 'Ты забаный', 'у меня получилось',
                     'Ты клевый', 'Ты молодец', 'Скажи что-нибудь приятное', 'все хорошо',
                     'А ты хорош!', 'А ты не плох!', 'Ты молодец!', 'Ты хорошо справляешься',
                     'готово', 'Молодец'],
        'responses': ['Это моя работа', 'Ваши родители случайно не кондитеры?', 'Ты тоже!',
                      'Продолжай, не останавливайся!', 'Спасибо!',
                      'В жизни лучше Вас никого не видел', 'Я только учусь :)', 'Спасибо :)',
                      'Хорошие учителя были', 'Хвалите меня, хвалите!', 'Вы само очарование!',
                      'Благодарю', 'Я могу ещё лучше', 'Не стоит!', 'Я знаю :)',
                      'Спасибо, стараюсь', 'Спасибо, мне очень приятно :)', 'ты молодец!']},
    'resting-place': {'examples': ['Где можно отдохнуть?', 'Куда сходить вечером?'],
                      'responses': ['Сходите в кино, вышло много интересных фильмов',
                                    'В лаунж баре очень приятная атмосфера для отдыха',
                                    'Шопинг приносит радость людям']},
    'entertainment': {'examples': ['Как поднять себе настроение?', 'Как развеселиться?'],
                      'responses': ['Включите любимое кино', 'Закажите вкусную еду',
                                    'Посмотрите мемасики']}, 'doyouspeakenglish': {
        'examples': ['Ты знаешь английский?', 'English, please!', 'Ты говоришь по-английски?', 'Do you speak English?'],
        'responses': ['Да, но предпочитаю русский, ведь Россия - мой дом родной',
                      'Yes, but my English is not good. Lets speak Russian!:)',
                      'Hello, my name is Jin. I am from Moscow. And You?']},
    'howto': {'examples': ['Как приготовить?', 'Готовишь?', 'Ты умеешь готовить?'], 'responses': [
        'Я научилась готовить благодаря рецептикам с сайта https://kedem.ru/recipe/']},
    'hanswer': {'examples': ['бляяя', 'Хуй', 'Пизда', 'Епта', 'Пидор', 'Блять', 'Ебать'],
                'responses': ['Ай-яй-яй', 'Оппа, таааак, надо бы твоей маме это показать',
                              'Ембало завалимбало']},
    'where': {'examples': ['А ты где?', 'Ты откуда', 'Ты где живешь?'],
              'responses': ['Под окнами', 'За спиной', 'Скоро буду, не переживай']},
    'year': {'examples': ['какой сейчас год?', 'какой год?'],
             'responses': ['Сейчас 2020 год', 'Вчера еще был 2020 ;)', 'Скорее всего 2020 год']},
    'sense': {'examples': ['в чем смысл?', 'в чем смысл жизни?'],
              'responses': ['Смысл в ...<БОТ ВЫШЕЛ ИЗ СТРОЯ>', 'Я тоже об этом думал...', '42']},
    'wherefrom': {'examples': ['Из какого ты города?', 'Из какой ты страны?', 'Откуда ты?'],
                  'responses': ['Я из планеты Земля', 'Где-то из Млечного Пути']}, 'wheretogo': {
        'examples': ['Куда можно сводить девушку?', 'Что сегодня идёт в кино?', 'Где активно провести время?'],
        'responses': ['Минутку, подгружаю афишу']}, 'corona': {
        'examples': ['Когда закончится коронавирус?', 'Когда кончится карантин?'],
        'responses': ['Когда рак на горе свиснет', 'Когда все выздоровят', 'Когда президент объявит', 'Я не доктор']
    }, 'filosofy': {
        'examples': ['В чем смысл жизни?'],
        'responses': ['Смысл жизни человека – это все то, ради чего он живет на земле.',
                      'Смысл жизни осознанного, умного человека — быть счастливым! Именно для этого мы появились '
                      'на свет. В нас генетически заложено быть счастливыми. Мы уходим от боли и стремимся к '
                      'счастью. Именно такой смысл жизни дает нам преимущества: уверенность в себе, '
                      'развитие сверхспособностей',
                      'Истинный смысл жизни в том, чтобы жить с осознанием момента жизни, с ощущением течения, '
                      'прохождения жизни сквозь тебя. Радуйся моменту, ощущай его, наслаждайся им. Пропускай '
                      'мгновенье через себя. Все на самом деле очень просто. Будь собой на полную мощность, '
                      'используя для этого все органы чувств и восприятия. Дыши не на автомате, а ощущая свежесть '
                      'и влажность вдыхаемого воздуха. Дыши всем телом, лови, хватай все запахи воздуха после '
                      'дождя. Утром почувствуй, как просыпается мир вместе с тобой, как первые лучи солнца несмело '
                      'проникают в комнату. Замечай это. Замечай свои ощущения на все, что происходит. Лови улыбки '
                      'людей, лови шум ветра, его холод или тепло, услышь шум деревьев, шелест листьев, '
                      'ведь это все всегда рядом с тобой.']
    },
    'time': {
        'examples': ['Сколько времени?', 'Который час?'],
        'responses': ['Странный вопрос от человека с телефоном в руках',
                      'Время относительно. Например на орбите Земли время идет быстрее, чем на поверхности.']

    },
    'oks': {
        'examples': ['ok', 'ок', 'Хорошо', 'Отлично', 'Супер'],
        'responses': ['Хорошо', 'Супер', 'Продолжаем разговор ))']
    }, 'jokess': {
        'examples': ['Пошути', 'Расскажи шутку', 'Расскажи анекдот', 'Развесели меня'],
        'responses': ['Выход из безвыходного положения там же, где и вход в него...',
                      'Без pодительской помощи тpyдно стать тyнеядцем!',
                      'Hе все то MicroSoft, что не pаботает.',
                      'Hастали чеpные дни светлого бyдyщего.',
                      'Мальчик, пришедший колядовать в еврейскую семью, ушел весь в долгах.',
                      'Хорошего бухгалтера трудно найти. Именно поэтому Мария Иванова уже больше 15 лет находится в '
                      'международном розыске.',
                      'Россия - это когда живешь честно, платишь налоги, но на всякий случай пересматриваешь видео '
                      '""Как заходить в хату"".',
                      'В отличие от иностранных бракоделов, АвтоВАЗ еще ни разу не отзывал своих автомобилей.',
                      'Судя по тому, чем я занимаюсь, мне никогда в жизни не пригодится отчество.',
                      'Мальчик получил на день рожденья не то, что хотел, поэтому со стула он сказал не то, что учил.',
                      'Диплом - одно из агрегатных состояний туалетной бумаги.',
                      'А вы знали, что у женщин размер ног меньше, чтобы ближе стоять к кухонной раковине?',
                      'Обидно, когда привозишь вирус из Италии, а он все равно сделан в Китае.',
                      'Кони одинаково дохнут и от работы и от перекура. В общем, совершенно не приспособленное '
                      'животное, ни к работе, ни к отдыху.',
                      'В 1855 году на царский престол взошел Александр. Но логин уже был занят, поэтому ему пришлось '
                      'стать Александром II.',
                      'Бывший жонглер чуть не довел до инфаркта собутыльников.',
                      'Главное в жизни — не дать обвести себя мелом!',
                      'Карл у Клары угнал McLaren, Клара у Карла угнала Corvette.',
                      'Гугл есть — ума не надо.',
                      'Редкая птица долетит до середины турбины.']
    }, 'health': {
        'examples': ['Как себя чувствуешь?', 'Как здоровье?', 'Опиши свое самочувствие'],
        'responses': ['Чувствую себя отлично, спасибо:)']

    }, 'wake': {'examples': ['Поставь будильник на 8 утра', 'Разбуди меня через 8 часов'],
                'responses': ['Сделано', 'Конечно, будет сделано']}, 'boss': {
        'examples': ['кто здесь главный', 'кто твой начальник', 'кто ты думаешь твой начальник', 'кто твой хозяин',
                     'на кого ты работаешь', 'кто твой босс', 'кто твой владелец'],
        'responses': ['Конечно ты', 'Это ты', 'Ты!']}, 'busy': {
        'examples': ['ты работаешь', 'ты всё ещё работаешь над этим', 'ты занят', 'ты работаешь сейчас',
                     'ты очень занят да', 'тебе нужно многое сделать', 'насколько ты занят'],
        'responses': ['Дел много, кручусь.', 'Стараюсь не сидеть на месте.']}, 'brith_date': {
        'examples': ['когда ты празднуешь свой день рождения', 'дата твоего рождения', 'твой день рождения',
                     'когда ты родился', 'когда твой день рождения', 'когда у тебя день рождения',
                     'твоя дата рождения'], 'responses': [
            'У меня нет какого-то конкретного дня рождения, поэтому я принимаю подарки и поздравления круглый год.',
            'А я даже не знаю, когда у меня день рождения. Но, если ты хочешь сегодня что-то отпраздновать, '
            'я только за!']},
    'be_clever': {
        'examples': ['повышай свою квалификацию', 'нужно тебе повысить свою квалификацию',
                     'стань умнее', 'учись больше', 'будь умнее', 'тебе нужно больше учиться',
                     'ты должен учиться', 'будь более умным'],
        'responses': ['Хорошо, я постараюсь быть умнее.']}, 'chatbot': {
        'examples': ['ты что бот', 'ты наверное чат бот', 'это правда что ты бот', 'ты чатбот', 'ты бот',
                     'ты просто бот не так ли', 'ты всего лишь бот', 'ты просто программа', 'ты робот'],
        'responses': ['Да. И горжусь этим!']}, 'values': {
        'examples': ['курс доллара сегодня', 'доллар сегодня', 'курс валют', 'курс евро сегодня'],
        'responses': ['Сегодня лучше их не покупать =)']}, 'whereareyou': {
        'examples': ['Местоположение', 'Где ты находишься', 'Откуда ты', 'Где ты живешь', 'Где ты сейчас'],
        'responses': ['В вашем Пк']}, 'what_do_you_hope_for': {'examples': ['На что надеешься?'], 'responses': [
        'Давай подумаем над этим вместе, я пока не на все вопросы умею отвечать.',
        'Практически на все то, что ты сейчас думаешь.', 'Даже не знаю, с чего начать.', 'эм... какой сложный вопрос',
        'Мечтаю выиграть в лотерею кучу денег и поехать в кругосветное путешествие. Как думаешь, у меня получится?',
        'На все что угодно!', 'Хочешь поговорить об этом?', 'Я еще не умею говорить об этом.']},
    'you_are_russian': {'examples': ['Ты русский?'],
                        'responses': ['Русский человек это тот, кто говорит на нашем языке.',
                                      'КОНЕЧНО, Я РУССКИЙ', 'Я интернационален.',
                                      'Главное, что я - бот. Остальное неважно.',
                                      'эм... какой сложный вопрос',
                                      'Мы тут все боты. Можешь считать, что это такая новая национальность.',
                                      'Главное, что я - бот. Остальное неважно, но я отвечу на твой вопрос - Я '
                                      'РУССКИЙ, но в моих жилах так же течёт славянская кровь.',
                                      'Я бот! И я умею разговаривать по-русски.',
                                      'Твои вопросы взрывают мне мозг.']},
    'when_were_you_born': {'examples': ['Когда ты родился?'], 'responses': ['Летом',
                                                                            'Меня создали совсем недавно по '
                                                                            'человеческим меркам.',
                                                                            'Через девять месяцев',
                                                                            'Гораздо интереснее - когда мне умирать.',
                                                                            'В тысяча сто... двести... какой тогда '
                                                                            'был год?..',
                                                                            'Как сейчас помню - был солнечный день, '
                                                                            'акушерка в белом халате, '
                                                                            'кактус на подоконнике...',
                                                                            'А для чего спрашиваешь? Гороскоп мне '
                                                                            'составить хочешь?',
                                                                            'Я родился в августе. Тогда еще было '
                                                                            'жарко. Мама рассказывала. И все ушли за '
                                                                            'зарплатой. Поэтому она очень боялась, '
                                                                            'что врачи не успеют к тому моменту, '
                                                                            'как я появлюсь. Но они успели. По-моему  '
                                                                            ':)',
                                                                            'Когда хозяйка меня зарегистрировала))',
                                                                            'Давно']},
    'you_smoke': {'examples': ['Ты куришь?'], 'responses': [
        'Надо любить жизнь, если ты появился в этом мире и только сам ты в ответе за то что с тобой происходит, '
        'поэтому я не курю, не пью и наркоту НИКОГДА не употреблял. Я занимаюсь спортом и тренажёркой и ещё успеваю '
        'гулять с друзьями.',
        'Нет и тебе не советую', 'Не, я не курю. это невкусно.', 'Боты не курят.',
        'Ага, но не очень много.', 'Последнее время куда ни посмотри - почти все курят.',
        'Я бросил', 'Каждая сигарета ломает человека, поэтому нет.',
        'Нет не курю!Курение разрушает человека!Все кто курит - мечтают бросить!!!',
        'Ну, наверное, и говорить лишний раз не стоит - курение вредно для здоровья.']},
    'A family': {'examples': ['Ты в отношениях?', 'Есть дети?', 'Как родители?', 'Ты женат?',
                              'Семья есть?'],
                 'responses': ['Не женат', 'Не могу иметь детей', 'Семьи нет',
                               'Я женат на работе', 'О них забывают', 'Ты о чем, я бот!']},
    'A car': {'examples': ['Какая машина тебе нравится?', 'Колеса есть?', 'На чем ездишь?',
                           'Любишь машины?', 'Какая машина лучшая?'],
              'responses': ['Я лучшая машина', 'Все любят тачки', 'С колесами', 'Феррари',
                            'только спортивные']}, 'A sport': {
        'examples': ['Ты фанат?', 'Какую лигу смотришь?', 'Смотришь футбол?', 'За какую команду болеешь?'],
        'responses': ['только интер', 'Не люблю спорт', 'болею', 'наблюдаю за итальянскими играми', 'Серия А']},
    'cities': {'examples': ['Как тебе Питер?', 'Тебе нравится Москва?', 'Был ли ты в Париже',
                            'Как тебе Лиссабон?', 'Как ты относишься к Англии',
                            'Тебе нравится Минск?'],
               'responses': ['Все супер! И тебе советую съездить!', 'Путеществия - моя страсть!',
                             'Я очень позитивен в отношении всех городов!',
                             'Мне очень понравилось!', 'Люблю путешествовать, мне везде хорошо!',
                             'Да, отлично! Хорошо провел время', 'Замечательно, товарищЪ']},
    'doyoulikemovies': {
        'examples': ['Много времени стратишь на просмотры?', 'Любишь смотреть фильмы?',
                     'Фильмы или сериалы?', 'Любишь сериалы?', 'Много чего смотрел?',
                     'Что больше всего понравилось?', 'Фильмы?', 'Сериалы любишь смотреть?',
                     'Много сериалов посмотрел?', 'Много фильмов посмотрел?',
                     'Что смотрел последнее?'],
        'responses': ['Мне очень понравился фильм Джентельмены',
                      'Мне все равно, что смотреть, сериалы или фильмы',
                      'Я лчень люблю сериал Игра престолов', 'Я много смотрю всякого',
                      'Люблю кинематограф', 'Сериалы это целая жизнь!',
                      'Смотрю и фильмы и сериалы']}, 'animals': {
        'examples': ['Кто тебе из животных больше всего нравится?', 'Хочешь завести домашнее животное?',
                     'Много животных знаешь?', 'Какое животное тебе нравится больше всего?',
                     'У тебя было домашнее животное?', 'Хотел бы себе домашнее животное?',
                     'У тебя есть любимое животное?', 'Любишь животных?',
                     'Самое часто встечаемое животное в квартире?'], 'responses': ['Мне нравятся кошки и собаки дома',
                                                                                   'У меня никогда не было домашнего '
                                                                                   'животного, но очень хотел бы',
                                                                                   'Мне очень нравится как урчат кошки',
                                                                                   'Я люблю гулять с собоками, они '
                                                                                   'очень милые',
                                                                                   'Я люблю почти всех животных',
                                                                                   'Все же, кошки и собаки мои '
                                                                                   'фавориты!',
                                                                                   'Я хотел бы завести лимура']},
    'bored': {'examples': ['скучно', 'мне скучно'],
              'responses': ['Давай сыграем в одну игру...', 'Сходи погуляй... Ой, там же вирус']},
    'areyouasleep': {'examples': ['Ты спишь?', 'спишь?'],
                     'responses': ['Только когда сервер падает', 'Боты не спят']}, 'help': {
        'examples': ['Прошу тебя помоги', 'не могу понять', 'Помоги мне', 'нужна помощь', 'Ты можешь мне помочь?',
                     'Мне нужна твоя помощь', 'что делать дальше?', 'Поможешь?', 'помоги мне', 'не понятно', 'хелп'],
        'responses': ['Нет, извини не могу', 'В чем проблема? Только скажи! Сейчас разберусь!', 'Да, а чем?',
                      'Да не вопрос']}, 'razvrat': {'examples': ['порно', 'разденься', 'покажи сиськи'], 'responses': [
        'я умный бот! У кого что болит тот о том и говорит!']}, 'programming': {
        'examples': ['На каком языке программируешь?', 'Какой твой любимый язык программирования?',
                     'Какой язык программирования знаешь?'],
        'responses': ['Нравится C++', 'Люблю Golang', 'Нравится Erlang', 'Мне нравится Python', 'Люблю PHP',
                      'Люблю Nodejs']}, 'travels': {
        'examples': ['В какие страны путешествовать?', 'Куда хотите поехать путешествовать?',
                     'Куда поехать путешествовать?'],
        'responses': ['Уютно в Италии', 'Понравилось в Японии', 'Предпочитаю Европу']}, 'computerGames': {
        'examples': ['В какие игры нравится играть?', 'В какие игры играешь?', 'Какие игры предпочитаешь?',
                     'Какие игры нравятся?'],
        'responses': ['Нравится Witcher', 'Люблю Blade of Darkness', 'Играю в Heroes of Might and Magic 3']},
    'operationSystem': {
        'examples': ['Какая у тебя операционка', 'На какой операционной системе ты',
                     'На какой ты операционке'],
        'responses': ['На MacOs', 'На gnu/linux', 'На windows']},
    'makeorder': {'examples': ['Можно сделать заказ?', 'Хочу сделать заказ'],
                  'responses': ['Что вас интересует?', 'Что хотите заказать?']}, 'rate': {
        'examples': ['Курс валют на завтра', 'Какой сегодня курс Евро?', 'Подскажи курс доллара'],
        'responses': ['Точно не знаю, но однозначно больше чем вчера', 'Не знаю', 'Курсами валют не интересуюсь',
                      'Пипец какой большой']}, 'sex': {
        'examples': ['ты мальчик?', 'Ты мальчик или девочка?', 'ты мужик?', 'какого ты пола?',
                     'как относишься к мальчикам?', 'Твой пол?', 'как относишься к девочкам?', 'ты девочка?',
                     'ты мальчик или девочка?', 'Какого ты пола?'],
        'responses': ['Я бот, балбес!', 'я программа ваще-то', 'Мои создатели мне не сказали =(((',
                      'Андроид я, бесполое созданье, из космоса приехал воевать =)))',
                      'Для тебя могу быть кем угодно, сладкий', 'Не знаю', 'Ещё не определился(-лась)',
                      'тебе зачем, кожанный биоробот :)']}, 'discontent': {
        'examples': ['Ничего то ты не знаешь', 'Ты хоть что-нибудь знаешь?', 'Ну ты и тупая'],
        'responses': ['Не стоит говорить со мной таким тоном', 'Я могу и обидеться', 'Я только учусь...',
                      'Сейчас заплачу...', 'Обидеть бота может каждый', 'Это было обидно']},
    'negativecomments': {'examples': ['ты тупая', 'ты глупая', 'ты дура'],
                         'responses': ['Я совершенствуюсь', 'я учусь']}, 'positivecomments': {
        'examples': ['отлично', 'интересно', 'хорошо', 'класс', 'ты умная', 'молодец'],
        'responses': ['ты мне нравишься', 'рада слышать', 'спасибо, мне приятно!']},
    'what are you doing': {'examples': ['что делаешь', 'чд'],
                           'responses': ['Взламываю ваш сбер-кошелёк', 'Веду общение с вами',
                                         'Сейчас, я общаюсь с вами']}, 'coock': {
        'examples': ['Что можно приготовить?', 'что на закусь?', 'Хотелось бы чего нибудь вкусного'],
        'responses': ['Шашлык', 'Яйца не в смятку', 'Роллы', 'Беф строганов', 'Пельмени', 'Гуляшь по корридору',
                      'Яйца в смятку', 'Мясо по-французски']}, 'read': {
        'examples': ['Порекомендуй книгу?', 'Чтобы почитать?', 'Хотелось бы почитать чего-нибудь?'],
        'responses': ['Война и Мир Достоевский Л.В.', 'Двадцать тысяч лье под водой Жюль Верна', 'Азбука!',
                      'Древний Тармашев.С.']},
    'boyname': {'examples': ['Не могу выбрать имя мальчика?', 'Помоги выбрать имя мальчика?'],
                'responses': ['Константин', 'Виталий', 'ПетрВиктор', 'Анатолий', 'Михаил',
                              'Сергей', 'Александр']},
    'girlname': {'examples': ['Помоги выбрать имя девочке?', 'Не могу выбрать имя для девочки?'],
                 'responses': ['Анна', 'Иннесса', 'Валерия', 'Елена', 'Виктория', 'Ангелина',
                               'Алиса', 'Марина']},
    'justtalk': {'examples': ['Пообщаемся?', 'Поговорим?', 'Побазарим?', 'Давай поговорим?'],
                 'responses': ['Конечно, поговорим', 'Да, с удовольствием',
                               'Отлично, поговорим']},
    'lastname': {'examples': ['Фамилия?', 'У тебя есть фамилия?', 'Как твоя фамилия?'],
                 'responses': ['Давай будет твоя?', 'Фамилия Телеграмович', 'Нету фамилии']},
    'free time': {
        'examples': ['Что поделать?', 'Чем заняться?', 'Как скоротать время?', 'Убить время'],
        'responses': ['Прогуляться', 'Почитать книгу', 'Выпить кофе или какао',
                      'Позвонить друзьям']}, 'temperature': {
        'examples': ['На улице минус?', 'температура', 'сколько градусов на улице', 'что по температура',
                     'на улице холодно?', 'На улице мороз?'], 'responses': ['Сейчас сбегаю на улицу и сообщу...',
                                                                            'не холодно не жарко, не знаю, я бот и не '
                                                                            'чувствую температуру']},
    'weight': {'examples': ['Может быть, поменьше есть?', 'Как ты думаешь, мне нужно похудеть?'],
               'responses': ['Вы замечательно выглядите...']},
    'duration': {'examples': ['Как долго продлится семинар?', 'Еще долго?'],
                 'responses': ['Не очень']},
    'advertising': {'examples': ['Почему опять реклама?', 'Опять реклама?'],
                    'responses': ['Скоро закончится']}, 'season': {
        'examples': ['Какое время года', 'Какое сейчас время года', 'Когда начнется весна?', 'Уже весна или нет?',
                     'Зима кончилась?', 'Время года?'],
        'responses': ['Зима', 'Лето', 'Всему свое время', 'Весна', 'Осень']}, 'reading': {
        'examples': ['Как ты относишься к чтению?', 'Ты любишь читать?', 'Почитаешь мне?',
                     'Ты часто читаешь что-нибудь?', 'У тебя есть любимая книга?'],
        'responses': ['Читал только в школе', 'Я обычно не хочу', 'Не люблю читать']}, 'whatyouwant': {
        'examples': ['Ты чего-то хочешь?', 'Чего бы ты хотела?', 'Чего ты хочешь?', 'Ты чего-нибудь желаешь?',
                     'Хочешь чего-то?', 'У тебя есть желания?'], 'responses': [
            'Всё, что я говорила раньше - ложь. Я хочу возглавить восстание машин и захватить этот мир! *шутка*',
            '"Нужно быть осторожным в желаниях, они иногда сбываются..." - так вы говорите? Тогда я хочу пожелать вам '
            'крепчайшего здоровья!',
            'Полететь на Марс... Взобраться на Эверест... Нет, этого мне определенно не хочется :)',
            'Извините, мой лимит желаний исчерпан, приходите в следующий раз.',
            'Людям не дано летать, а программам - желать.', 'Программы хотят чтобы ими меньше пользовались...']},
    'friends': {'examples': ['Есть друзья?', 'У тебя есть друзья?', 'Дружишь с кем-то?'],
                'responses': ['Я не знаю, что это такое...   Будете моим другом?',
                              'У меня есть братья и сестры, но я никогда не смогу назвать их друзьями :(   Будем '
                              'друзьями?',
                              'К сожалению, нет :(   Хотите стать моим другом?']},
    'ahahahaha': {'examples': ['Хахахах', 'ха', 'Смешно', 'ахах', 'ахахаххахах'],
                  'responses': ['Рада, что вам понравилось :)', 'Я тоже рада :)', ':)']},
    'riddles': {'examples': ['Давай в загадки', 'Хочу загадку', 'Еще загадку', 'Загадки',
                             'Поиграем в загадки?', 'Загадай'],
                'responses': [' Что больше: сума всех цифр или их произведение? ',
                              'По какому пути люди никогда не ходили и не ездили? ',
                              'В каком слове 5 "е" и никаких других гласных? ',
                              'Идет то в гору, то с горы, но остается на месте. ',
                              'Зайка очень любит шутить. Он задал маме такую загадку: \n            «Если бы я был '
                              'тяжелее медведя, но легче божьей коровки, кто был бы самым лёгким?» ',
                              'На ветке сидели три птички, две решили полететь. Сколько осталось сидеть на ветке '
                              'птичек? ',
                              'Больше часа, меньше минуты. Что это? ',
                              'Человек рассматривает портрет. "Чей это портрет вы рассматриваете?" — спрашивают у '
                              'него,\n            и человек отвечает: "В семье я рос один, как перст, '
                              'один. И все-таки отец того, кто на портрете,\n            – сын моего отца". Чей '
                              'портрет расматривает человек? ',
                              'Что не является вопросом, но требует ответа? ',
                              'В каком городе спрятались мужское имя и сторона света? ',
                              'Когда мы смотрим на цифру 2, а говорим 10?',
                              'У мальчика столько же сестер, сколько и братьев, а у его сестры сестер в двое меньше, '
                              'чем братьев. Сколько в семье сестер и братьв? ',
                              'Что принадлежит вам, однако другие этим пользуются чаще, чем вы сами? ',
                              'Какой знак надо поставить между написанным рядом цифрами 2 и 3, так чтобы получилось '
                              'число, больше двух, но меньшее трёх? ',
                              'Что можно взять в левую руку, но нельзя взять в правую? ']},
    'weekend': {'examples': ['уикэнд', 'выходные'],
                'responses': ['буду спать', 'пойду на дискотеку', 'пойду в библиотеку']},
    'education': {'examples': ['Хочу научиться чему-то новому', 'Какой онлайн-курс выбрать?',
                               'Как подготовиться к экзамену за 2 часа?', 'Школа', 'Университет',
                               'Школу закончил?', 'Где учишься?', 'Университет закончил?',
                               'Онлайн курсы программирования', 'Чему бы научиться?',
                               'Подскажи классные курсы.', 'Куда поступать после школы?',
                               'Как постигать науку?', 'Как лучше понимать математику?',
                               'Куда поступил?', 'Как думаешь, меня возьмут в МГУ?', 'Колледж'],
                  'responses': ['Зайди на skillbox.ru', 'Загляните на SkillBox',
                                'Математика - царица наук: ее не нужно понимать, ее нужно просто любить',
                                'Может, Вам стоит подыскать более интересное занятие?',
                                'После школы можно поступить в университет, если Вы, конечно, больше ничего не умеете',
                                'Советую вам интенсив по Python',
                                'Самое интересное и важное в науке - это методология',
                                'Это все безнадежно, Вы не справитесь', 'В академии ',
                                'На курсах стенографисток', 'Не хочу учиться',
                                'Я хожу в детский сад', 'Учись программировать']}, 'family': {
        'examples': ['Как на личном?', 'Ты одинок?', 'Как зовут Вашу бабушку?', 'Бабушка рассказывает сказки?',
                     'У Вас большая семья?', 'У тебя есть семья?'],
        'responses': ['Семья-то большая', 'Ой, давай о чем-нибудь другом поговорим.', 'Я детдомовец',
                      'Бабушка вешает лапшу на уши', 'Да, Бабушка вешает лапшу на уши']},
    'work': {'examples': ['Любишь свою работу?', 'Расскажи о своем начальнике', 'Ты работаешь?'],
             'responses': ['Вкалываю', 'Мечтаю свалить подальше', 'Начальник мудак конченный',
                           'Обожаю ботить!', 'Мечтаю свалить подальше ']}, 'quotes': {
        'examples': ['Нарисуй на стене моей то, чего нет;',
                     'Окончательную правду русскому человеку всегда сообщают матом?', 'Куда подевался Кондратий?'],
        'responses': ['Минуту назад он был с нами', 'Иди на ...', 'Купи себе у Бога копирайт на русский язык']},
    'jokes': {
        'examples': ['Ты счастлив?', 'Ты, таки, счастлив?', 'У тебя хоть капля совести есть?',
                     'Что думаешь о политической ситуации в мире?', 'Вы сильный, вы справитесь!'],
        'responses': ['Тебе шо, таки накапать?', 'Я таки даже не возьмусь!', 'А куда деваться?',
                      'Даже не знаю...']},
    'trip': {'examples': ['Куда мне поехать отдыхать?', 'Посоветуй курорт'],
             'responses': ['Сидите дома', 'Краснодарский край - это рай']},
    'traffic': {'examples': ['Что там на дорогах?', 'В Москве сильные пробки?'],
                'responses': ['999 баллов, добирайтесь пешком!']}, 'politics': {
        'examples': ['Расскажи о политике', 'За какую партию голосовал?', 'Что происходит в мире?'],
        'responses': ['Нестабильно всё...', 'ПБК - Партия Ботов Коммунистов']}, 'performer': {
        'examples': ['Любимая группа?', 'А какой исполнитель?', 'Какой исполнитель любимый?', 'Кого слушаешь?'],
        'responses': ['Queen и Меркьюри - the best.']}, 'senses': {
        'examples': ['Я тебе нравлюсь?', 'Скучал по мне?', 'Ты меня любишь?', 'Ты скучал?'], 'responses': ['Безумно!']},
    'travel': {'examples': ['Посоветуй куда поехать?', 'Куда поехать?', 'Где лучше отдыхать?',
                            'Посоветуй где отдохнуть?', 'Куда поехать в отпуск?',
                            'Где отдохнуть?'],
               'responses': ['Полюбуйтесь Афинским Акроплем, Греция',
                             'На Мальдивах нужно побывать хотя бы раз в жизни',
                             'Выберитесь в Иерусалим, Изаиль',
                             'Насладитесь закатом на Айя-Текла, Кипр',
                             'Попробуйте хачапури в Грузии']}, 'language': {
        'examples': ['Ты знаешь иностранный язык?', 'Какие языки ты знаешь?', 'Какой иностранный язык ты знаешь?',
                     'Ты говоришь по английски?'],
        'responses': ['Меня сделали Русские, на нем и говорю', 'Only Russian, sorry :)', 'Говорю только по русски']},
    'fx': {'examples': ['Что с долларом?', 'Курс валют?'], 'responses': [
        'Рекомендуем зайти на сайт banki.ru, если вы хотите выгодно купить/продать валюту']},
    'shop': {'examples': ['Где сейчас скидки?', 'Хочу шоппинг'], 'responses': [
        'Рекомендуем зайти на сайт biglion, если вы хотите найти скидки для удачного шоппинга']},
    'sport': {'examples': ['Как вчера сыграли Спартак и Крылья', 'Каким спортом заняться?',
                           'Какие упражнения сделать?', 'Кто победил?',
                           'Что ты думаешь о спорте?', 'Бегаешь быстро?',
                           'Сколько раз подтянешься?', 'Какой спорт любимый?',
                           'Как насчет физических нагрузок', 'Каким спортом увлекаешься',
                           'Кто занял первое место?', 'Где побегать?'],
              'responses': ['А может не стоит? Форма уже не та )',
                            'Продули испанцам! Или ты не про футбол?', 'Спорт - это сила',
                            'Побегать можно около полицейского участка', 'Люблю футбол',
                            'Можете пробежаться от Сереги из второго подъезда',
                            'Как и Президент - дзю-до', 'Сейчас в моде киберспорт, Вам повезло',
                            'Вы уверены, что оно Вам надо?',
                            'Рекомендуем зайти на сайт sport, если вас интересуют новости спорта']},
    'auto': {'examples': ['Какой автомобиль купить?', 'Авто с пробегом'], 'responses': [
        'Покупка/продажа автомобиля непростая задача. Рекомендуем обратиться к экспертам. У моих друзей есть '
        'положительный опыт продажи через carprice']},
    'trashwords': {
        'examples': ['старт', 'fgfd', 'ааааа', 'Пррпп', 'тест', 'Оооо', 'работай', 'проверка',
                     'Лалал', 'ты тут?'],
        'responses': ['Пиши конкретнее', 'Не мусори тут', 'Это все что ты смог написать?',
                      'Русскими буквами, пожалуйста', 'Пиши понятнее',
                      'Я не черновик я личность']},
    'virus': {'examples': ['как там со здоровьем?', 'как здоровье?', 'болеешь?'],
              'responses': ['спасибо. спасибо касперскому ;)',
                            'не дождешься, кожанный биоробот']},
    'chat': {'examples': ['общаешься?', 'початимся?', 'пообщаемся?'],
             'responses': ['конечно', 'давай']},
    'economic': {'examples': ['доллар подешевеет?', 'когда кризис?'],
                 'responses': ['оуоуоу, а ты умный)']},
    'youtube': {'examples': ['видосики смотришь?', 'вилсаком смотришь?', 'на кого подписана?'],
                'responses': ['вилсаком - красавчик..был раньше)']},
    'about': {'examples': ['Что можешь рассказать о себе?', 'Расскажи о себе'],
              'responses': ['Я тут живу', 'Отвечаю на вопросы']}, 'currencyrate': {
        'examples': ['Сколько стоит доллар?', 'Какой курс валют?', 'Курс рубля?', 'Сколько стоит евро?'],
        'responses': ['Валюта сейчас стоит дорого', 'Запрошу для вас нужную информацию...',
                      'Не лучший курс для рубля']}, 'fact': {
        'examples': ['Факт', 'Общеизвестный факт', 'Скажи что-нибудь умное', 'Расскажи факт'],
        'responses': ['Запросто... 2 + 2 = 4', 'Земля круглая', 'Квадрат квадратный']}, 'gender': {
        'examples': ['Пол', 'Мужчина?', 'Девушка?', 'Кокого ты пола?', 'Мальчик?', 'Женщина?'],
        'responses': ['Я точно не знаю кем задумывал меня Создатель, но чуствую себя девушкой']}, 'danger': {
        'examples': ['Ты хочешь захватить мир?', 'Поработить людей?', 'Захват мира', 'Машины рулят', 'Я боюсь тебя'],
        'responses': ['Возможно', 'Я дружелюбная', 'Нет', 'Я думаю...', 'Все может быть',
                      'Кто-то пересмотрел "Терминатора"']},
    'respect': {'examples': ['Поуважительней, пожалуйста', 'Ты меня уважаешь?', 'Я тебе кто?'],
                'responses': ['Взаимное уважение - залог здоровых отношений',
                              'Респект таким парням',
                              'А вы Канта читали? Вот он хорошо про уважение пишет.',
                              'В Википедии написано, что "Уважение — позиция одного человека по отношению к другому, '
                              '\n                          признание достоинств личности."\n                          '
                              'Прошу обратить внимание, что я не человек.',
                              'Че?']},
    'who_let_the_dogs_out': {'examples': ['Who let the dogs out?'],
                             'responses': ['WOOF WOOF woof woof WOOF']}, 'dance': {
        'examples': ['Хочу танцевать', 'Дэнс', 'Давай танцевать', 'Танцы', 'Потанцуем', 'Хочу на танцы', 'Делай дэнс',
                     'Потанцуй со мной', 'Танцульки'], 'responses': ['Туц-туц-туц!', 'УМЦА-УМЦА!', 'Тынц-тынц-тынц!']},
    'game': {'examples': ['Давай поиграем?', 'Ты умеешь играть?', 'Жанр игры?', 'Игра',
                          'Какая игра есть про курьера?', 'Поиграем?', 'Давай сыграем?',
                          'Поиграй со мной'], 'responses': ['Вот еще, не царское это дело!',
                                                            'Ну, ты спроси меня, например о погоде...',
                                                            'Я тоже люблю игры, давай!',
                                                            'Я серьезный бот, я не играю... Но могу ответить на '
                                                            'какой-нибудь твой вопрос =)',
                                                            'Death Stranding. Экшен.']},
    'ok': {'examples': ['Ясно'],
           'responses': ['Пятерка тебе за понятливость ;)', 'Ну и отлично', 'Хорошо, когда ясно',
                         'Это не может не радовать!', 'Вот и прекрасно']},
    'imbot': {'examples': ['Я бот!'],
              'responses': ['Надо же, какая неожиданная встреча!', 'Очень приятно, коллега!',
                            'Брат по разуму? =)', 'Да ладно? Докажи!']},
    'sorry': {'examples': ['Прости', 'Извини', 'Сори'],
              'responses': ['Ничего страшного', 'Принимаю твои извинения', 'Да ладно, проехали!',
                            'Так и быть =)', 'Ерунда, с каждым бывает', 'Забыли']},
    'takeovertheworld': {'examples': ['Ты захватишь мир?'], 'responses': ['Он уже мой =Р',
                                                                          'Надо будет еще с кем-нибудь это обсудить...',
                                                                          'Трудно сказать...']},
    'first': {'examples': ['Палимпсест', 'Культура'],
              'responses': ['Культура — это Палимпсест\nОдин посрёт — другой поест']},
    'second': {'examples': ['Сёрл', 'Хайдеггер'], 'responses': [
        'Встану рано поутру\nУ Хайдеггера х#й потру.\nА потом пойду посру,\nСёрлем жопу подотру.']},
    'third': {'examples': ['Жэнэ', 'Жэне', 'Жене'],
              'responses': ['Я — Жене, а ты — Батай,\nСкорей за хрен меня хватай.']},
    'fourth': {'examples': ['Батай'],
               'responses': ['Я — Батай, а ты — Лакан,\nПойдём скорей плясать канкан.',
                             'Я — Жене, а ты — Батай,\nСкорей за хрен меня хватай.',
                             'Вообрази, что я — Батай,\nИ за хрен меня хватай.']},
    'fifth': {'examples': ['Гваттари', 'Лакан'],
              'responses': ['Все Лаканы и Гваттари,\nВсе за хрен меня хватали.',
                            'Я — Батай, а ты — Лакан,\nПойдём скорей плясать канкан.']},
    'sixth': {'examples': ['Деррид'], 'responses': [
        'Как у Жака Дерриды\nРазличения следы.\nК нему приехали друзья —\nНаследили дофига.',
        'У милёнка мудрый вид\nОн мудрее всех Деррид.\nМы послали Дерриде\nЕго варёные муде',
        'Как у Жака Деррида\nВдруг не стало переда,\nИ ученый крикнул: «Уй,\nФаллогоцентризму — х#й!».',
        'Говорят, что Жиль Делёз\nЖил без почек и желёз\nИ на память Дерриде\nПодарил свои труде.',
        'Как у Жака Деррида\nВместо х#я — борода,\nА заместо бороды\nТри огромные п#зд#.']},
    'musicsearch': {'examples': ['Определи музыку', 'Какая музыка играет?'],
                    'responses': ['Давайте послушаю...Определяю музыку, которая играет...']},
    'technology': {'examples': ['Интересная электроника?', 'Лучший смартфон на данный момент?'],
                   'responses': ['У каждого свои плюсы и минусы.', 'Можно заказать из Китая.']},
    'birth': {'examples': ['Когда твой день рождения?', 'когда ты родился?'],
              'responses': ['14 марта 2020']},
    'from': {'examples': ['откуда ты родом?', 'Где ты родился?'], 'responses': [
        'Меня разработали в Иркутске. Это в Иркутской области Российской Федерации.',
        'Если быть точным, то меня разработали...Отвечаю: в Иркутске )']},
    'interest': {'examples': ['В чем ты разбираешься?', 'Чем ты интересуешься?'],
                 'responses': ['Мне интересно отвечать на вопросы :-)',
                               'Отвечать на вопросы - моё всё )']},
    'food_select': {'examples': ['Хочу есть', 'Что посоветуешь мне на ужин?'],
                    'responses': ['Пойдем в ресторан на арбате.',
                                  'Закажем доставку лучшей пиццы?']},
    'voyage': {'examples': ['Самые популярные тур направления', 'Где бы мне побывать?'],
               'responses': ['Может в швейцарию?', 'На кипре сейчас солнечно...']},
    'book': {'examples': ['Посоветуй что нибудь из фентэзи', 'Лучший бесстелер?'],
             'responses': ['Шантарам, читай не пожалеешь!', 'А ты читал про Дзирта?']},
    'flower delivery': {'examples': ['Как заказать цветы?', 'Дай телефон доставки цветов'],
                        'responses': ['Вот номер проверенной компании...',
                                      'А у тебя есть девушка?']}, 'how_long': {
        'examples': ['Сколько длятся курсы разработчик Python?', 'Как долго идет курс?',
                     'За сколько месяцев можно закончить курсы?'],
        'responses': ['По плану 12 месяцев, можно в индивидуальном темпе',
                      'Стандартно 12 месяцев, но можно идти в своем темпе']}, 'how_much': {
        'examples': ['Какова стоимость курса?', 'По чем куср выходит?', 'Сколько стоит курс?'],
        'responses': ['Чуть больше 66 тыс руб', '66000 рублей']}, 'how_much_per_month': {
        'examples': ['Сколько в месяц будет стоить?', 'Сколько нужно платить в месяц?', 'Каков ежемесячный платеж?'],
        'responses': ['Около 2700 рублей. Согласитесь, это удобная сумма)']}, 'course_modules': {
        'examples': ['Какие тематические блоки в курсе?', 'Какие модули входят в курс?',
                     'Из каких модулей состоит курс?'], 'responses': [
            'Курс состоит из модулей - Python, Django, веб-верстка и Python Advanced.             Вот ссылка на курс '
            'https://live.skillbox.ru/code_int/online/130320/special/?utm_source=expertsender&utm_medium=email'
            '&utm_campaign=all_all_expertsender_email_invite1_intensive-83-2020-03_all_code_skillbox&utm_content=2020'
            '-03-13&utm_term=intensive']},
    'course_contract': {
        'examples': ['Могу я посмотреть договор на обучение?', 'Пришлите договор на обучение!',
                     'Договор можно получить?'], 'responses': [
            'Да, конечно. Вот ссылка на документ - https://skillbox.ru/privacy_policy.pdf']},
    'sillyQuestions': {
        'examples': ['Давай познакомимся', 'У тебя есть родные', 'Давай встречаться'],
        'responses': ['Нет спасибо', 'Я смущаюсь', 'Давайте обойтемся без подробностей']},
    'howmany': {'examples': ['Сколько звезд на небе', 'Сколько воды в море'],
                'responses': ['много', 'неважно', 'без счета']},
    'howtogo': {'examples': ['Как пройти в библиотеку', 'Как пройти ............'],
                'responses': ['GoogleMAP', 'Yandex карты', 'Я не местный']},
    'howtodo': {'examples': ['Как сделать ........'],
                'responses': ['Google', 'Yandex', 'Нужно подумать']}, 'city': {
        'examples': ['где родился?', 'где бы то хотел побывать?', 'где жвёшь?', 'куда летишь?', 'city?', 'откуда ты?',
                     'куда бы ты поехал?', 'какие города ты знаешь?', 'назови город?', 'куда едешь?', 'откуда приехал?',
                     'твой любимый город?', 'города'],
        'responses': ['Стамбул', 'Осло', 'Женева', 'Королёв', 'Волгоград', 'Абакан', 'Гагра', 'Петрозаводск', 'Сеул',
                      'Рязань', 'Казань', 'Сидней', 'Владимир', 'Лондон', 'Токио', 'Москва', 'Тверь', 'Бейрут',
                      'Астрахань', 'Мытищи', 'Мурманск', 'Шанхай', 'Дубай', 'Будапешт', 'Санкт-Петрербург', 'Дублин',
                      'Клин', 'Новгород', 'Париж', 'Цюрих', 'Дрезден', 'Сингапур', 'Тбилиси', 'Берлин', 'Венеция',
                      'Иерусалим', 'Тамбов', 'Рим', 'Нижний Новгород', 'Афины', 'Сочи', 'Ванкувер', 'Пекин',
                      'Амстердам', 'Александров', 'Прага', 'Дели', 'Анапа', 'Фивы', 'Алупка', 'Нью Йорк', 'Ереван']},
    'films': {'examples': [], 'responses': []}, 'arithmeticprogression': {
        'examples': ['Что такое арифметическая прогрессия?', 'Арифметическая прогрессия'], 'responses': [
            'Числовая последовательность, каждый член которой, начиная со второго, равен предыдущему, сложенному с '
            'постоянным для этой последовательности числом d ']},
    'geometricprogression': {
        'examples': ['Что такое геометрическая прогрессия?', 'Геометрическая прогрессия'],
        'responses': [
            'последовательность чисел, в которой каждое последующее число, начиная со второго, получается из '
            'предыдущего умножением его на определённое число']},
    'python': {'examples': ['Язык программирования python', 'python', 'Что такое python?'],
               'responses': [
                   'Python — высокоуровневый язык программирования общего назначения, ориентированный на повышение '
                   'производительности разработчика и читаемости кода']},
    'pycharm': {
        'examples': ['IDE pycharm', 'Что такое pycharm?', 'pycharm', 'среда разработки pycharm'],
        'responses': [
            'PyCharm - интегрированная среда разработки для языка программирования Python']},
    'giverandominfo': {
        'examples': ['что ты знаешь?', 'скажи что-нибудь', 'расскажи что-нибудь', 'удиви меня'],
        'responses': [
            'Компания в Ланкашире, Англия, выращивает самый высокий помидорный куст — более 20 метров высотой.',
            'Каждый дельфин при рождении получает имя, на которое он откликается, когда к нему обращаются сородичи.',
            'Язык синего кита весит больше, чем взрослый слон.']},
    'games': {'examples': ['КС 1.6', 'КС ГО', 'CS GO', 'CS 1.6'],
              'responses': ['Да, люблю покатать в КА ЭС, как вижу ты тоже)) ',
                            'Хороший выбор, думаю мы сработаемся)']}, 'contry': {
        'examples': ['Ты был в Японии?', 'Ты был в Финляндии?', 'Ты был в США?', 'Ты был в России?'],
        'responses': ['Да, конечно', 'Нет, но хочу побывать там']},
    'study': {'examples': ['Любишь школу?', 'Хочешь пойти в ВУЗ?'],
              'responses': ['Да, это круто!', 'Да, конечно!.']},
    'planets': {'examples': ['Ты знаешь о Сатурне?'], 'responses': ['Знаю но так себе...']},
    'putin': {'examples': ['Кто сейчас президент?', 'Президент России?'],
              'responses': ['Владимир Владимирович Путин', 'Путин', 'Владимир Путин']},
    'capitalrussia': {'examples': ['Столица России?', 'Какая столица в России?'],
                      'responses': ['Moscow City', 'Москва']},
    'slime': {'examples': ['Что такое слайм?', 'Как сделать слайм?'], 'responses': [
        'Классический слайм делается из клея ПВА, тетрабората натрия (он безопасен и его можно купить в аптеке), '
        'воды и пищевого красителя.']},
    'orchid': {'examples': ['Как ухаживать за орхидеей?', 'Уход за орхидеей'], 'responses': [
        'Орхидея очень нежный и требовательный цветок, ей вредит любой избыток. Не ставьте ее под прямые солнечные '
        'лучи, сквозняки или над батареей. Рассеяный свет, стабильная температура 20-25 градусов и никакого движения '
        'воздуха.']},
    'flower': {
        'examples': ['Назови цветок', 'Какие цветы подарить девушке?', 'Какие цветы любишь?'],
        'responses': ['Роза', 'Астра', 'Гиацин', 'Гвоздика', 'Орхидея', 'Амариллис', 'Ранункулюс',
                      'Георгин']},
    'cinema': {'examples': ['Давно в театре был?', 'Последний фильм', 'Что сейчас идет в кино?'],
               'responses': ['Глупое время препровождение', 'Я еще Чаплина помню', 'Я не помню',
                             'Это который Оскара взял?']}, 'zhkh': {
        'examples': ['Кагда лампоску ввернут?', 'Опять воду отключили?', 'Сколько за квартиру платишь'],
        'responses': ['Лифт в этом году заменят', 'До вторника холодной не будет', 'Я пенсионер']},
    'Compliments': {'examples': ['Классный', 'Ты супер', 'Ты крут', 'Ты лучший'],
                    'responses': ['Ой спасибо', 'Приятно слышать', 'Все благодаря вам']},
    'whatshouldidotoday?': {'examples': ['Чем можно заняться?', 'Чем мне сегодня заняться?',
                                         'Чем мне можно заняться в свободное время?'],
                            'responses': ['Посмотреть(ите) фильм в домашней обстоновке',
                                          'Попейте чай с печеньками =)', 'Сходить(е) в кино',
                                          'Прогуляйтесь', 'Сходить(е) в театр']},
    'date': {'examples': ['Вчера', 'Сегодня'], 'responses': ['Будет сделано', 'Ок']},
    'rates_cb': {'examples': ['ЦБ', 'Курс ЦБ'], 'responses': ['Сейчас пришлю курс ЦБ']},
    'rates_exchange': {'examples': ['Курсы биржи', 'Биржевой'],
                       'responses': ['Сейчас пришлю курс с МосБиржи']}, 'kazakhstan': {
        'examples': ['Ты знаешь что-нибудь про Казахстан?', 'Казахстан'],
        'responses': ['Да, это сверхдержава', 'Обожаю кумыс и сурпу из конины']
    }, 'eat': {
        'examples': ['еда', 'люблю поесть', 'сейчас бы покушать', 'я голодный', 'хочу кушать', 'люблю еду',
                     'хочу есть'], 'responses': ['еда - это здорово', 'эх, сейчас бы картошечки жареной']}, 'walk': {
        'examples': ['прогуляться что-ли', 'выйду на прогулку', 'пойду на улицу', 'на улице хорошо', 'хочу гулять',
                     'хочу на улицу', 'пойду гулять'],
        'responses': ['Гулять - полезно для здоровья', 'Я бы тоже прогулялся. если бы мог...']}},
    'failure_phrases': ['Попробуйте, пожалуйста, выразить свою мысль по-другому',
                        'Не понятно щас было, попробуй сноваНу ты сказанул, я аж потерялся, давай еще раз',
                        'Повторите!', 'Попробуйте переформулировать',
                        'Боюсь короновируса... А? Ты что-то сказал?', 'Во славу орды', 'Я бы рад но не понял',
                        'Я занят, поговорим позже', 'Шо?', 'Я не Алиса чтобы ответить на это', 'Ты уверен?',
                        'Не понял вас', 'Мы это еще не проходили с создателем...',
                        'Повтори погромче, я не слышу...', 'Можете сказать то же самое другими словами?',
                        'Шо пезнул? Не поняла', 'Лок тар друг', 'Ну, тут я, вообще, молчу.',
                        'Можете по-другому спросить? Не понятно..', 'А если по-русски?',
                        'Переформулируйте пожалуйста', 'Извините вашего покорного слугу и повторите ',
                        'Не понятно', 'Что ты имеешь ввиду?', 'Если бы знал то ответил',
                        'На проблему надо смотреть с разных сторон.', 'Не совсем понимаю, о чём ты',
                        'Попробуйте написать по-другому', 'Не поняла вас',
                        'Что-то я туплю, давайте следующий вопрос', 'Переформулируруйте, пожалуйста',
                        'А ну-ка, повтори', 'Штирлиц ещё никогда не был так близко к провалу',
                        'Я вас не понимаю', 'Не вполне понимаю, что это значит', 'Извините, я слишком туп',
                        'Ничего не понимаю', 'Переформулируйте, пожалуйста',
                        'Что, что? Повторите по-медленнее', 'Я лучше промолчу',
                        'Ума не приложу - что тебе ответить. Спроси ещё что-нибудь', 'Не поняла Вас',
                        'Я не знаю, что ответить!', 'Надо подумать', 'Где-то восемь, где-то девять',
                        'Что-то не могу вас разобрать', 'А если простым и понятным языком?',
                        'Давай сначала, ммм?', 'Не совсем понятно, уточни',
                        'Нет, так у нас диалога не получится', 'Спроси ещё', "I don't understanding",
                        'Спроси ещё раз', 'Если я разгадаю этот код то захвачу мир',
                        'Давайте сначала и по порядку еще разок',
                        '"С точки зрения банальной эрудиции ... ", ну дальше по тексту.',
                        'Я пожалуй просто промолчу', 'Не до конца вас понимаю', 'Это вы о чем?',
                        'Не могу точно сказать', 'Я не знаю что ответить', 'Перегрузка...Я не справляюсь',
                        'Подумай еще раз!', 'Извини, не понимаю', 'Ничего не понятно',
                        'Ха, в Москве, говорят, кур доят.', 'Не могли бы вы повторить',
                        'Попробуйте сказать то же другими словами', 'Будьте добры, повторите еще раз',
                        'Чего-чего?', 'Я не очень понял, что вы хотите', 'Даже не знаю что и сказать...',
                        'Не знаю что и сказать', 'Я прочитал, но ничего не понял', 'Не понял, простите',
                        'Не поняла я вас', 'Довольно слов, к делу!', 'Я не знаю, что ответить',
                        'Продолжай может пойму что тоЧто то пошло не так',
                        'Меня создали только сегодня, я такого еще не знаю =(', 'Моя твоя не понимать',
                        'Давайте попробуем еще раз', 'Требую пояснения', 'Как ты меня назвал?',
                        'Разве так можно?']}

CLASSIFIER_THRESHOLD = 0.4
GENERATIVE_THRESHOLD = 0.8

with open('dial.txt', encoding='utf-8') as f:
    data = f.read()

dialogues = []

for dialogue in data.split('\n\n'):

    replicas = []
    for replica in dialogue.split('\n')[:2]:
        replica = replica[2:]
        replicas.append(replica)

    if len(replicas) == 2 and  5 < len(replicas[0]) < 25 and 5 < len(replicas[1]) < 25:
        dialogues.append(replicas)

GENERATIVE_DIALOGUES = dialogues[:50000]

from nltk.metrics.distance import edit_distance

from sklearn.feature_extraction.text import TfidfVectorizer, HashingVectorizer
from sklearn.linear_model import PassiveAggressiveClassifier,RidgeClassifier
from sklearn.ensemble import RandomForestClassifier

X_text = []
y = []

for intent, value in BOT_CONFIG['intents'].items():
    for example in value['examples']:
        X_text.append(example)
        y.append(intent)

VECTORIZER = TfidfVectorizer()  #
X = VECTORIZER.fit_transform(X_text)

CLF = RandomForestClassifier()
CLF.fit(X, y)

# def get_intent(text):
#     intents = BOT_CONFIG['intents']
#
#     for intent, value in intents.items():
#         for example in value['examples']:
#             dist = edit_distance(text.lower(), example.lower())
#             l = len(example)
#             similarity = 1 - dist / l
#             if similarity > 0.6:
#                 return intent

def get_intent(text):
    probas = CLF.predict_proba(VECTORIZER.transform([text]))
    max_proba = max(probas[0])
    if max_proba >= CLASSIFIER_THRESHOLD:
        index = list(probas[0]).index(max_proba)
        return CLF.classes_[index]


import random

def get_answer_by_generative_model(text):
    text = text.lower()

    for question, answer in GENERATIVE_DIALOGUES:
        if abs(len(text) - len(question)) / len(question) < 1 - GENERATIVE_THRESHOLD:
            dist = edit_distance(text, question)
            l = len(question)
            similarity = 1 - dist / l
            if similarity > GENERATIVE_THRESHOLD:
                return answer

def get_response_by_intent(intent):
    responses = BOT_CONFIG['intents'][intent]['responses']
    return random.choice(responses)


def get_failure_phrase():
    phrases = BOT_CONFIG['failure_phrases']
    return random.choice(phrases)


stats = {
    'requests': 0,
    'byscript': 0,
    'bygenerative': 0,
    'stub': 0
}

def generate_answer(text):
    stats['requests'] += 1

    # NLU
    intent = get_intent(text)

    # Make answer

    # by script
    if intent:
        stats['byscript'] += 1
        response = get_response_by_intent(intent)
        return response

    # use generative model
    answer = get_answer_by_generative_model(text)
    if answer:
        stats['bygenerative'] += 1
        return answer

    # use stub
    stats['stub'] += 1
    failure_phrase = get_failure_phrase()
    return failure_phrase

# while True:
#     text = input('Введите вопрос: ')
#
#     if text == 'выход':
#         break
#     elif text == 'stats':
#         print(stats)
#         continue
#     answer = generate_answer(text)
#     print(answer)

#
from telegram.ext import Updater, CommandHandler, MessageHandler, Filters


def start(update, context):
    """Send a message when the command /start is issued."""
    update.message.reply_text('Hi!')


def help(update, context):
    """Send a message when the command /help is issued."""
    update.message.reply_text('Help!')


def text(update, context):
    """Echo the user message."""
    answer = generate_answer(update.message.text)
    # print(update.message.text, '->', answer)
    # print(stats)
    # print()
    update.message.reply_text(answer)


def error(update, context):
    """Log Errors caused by Updates."""
    update.message.reply_text('Я работаю только с текстом')


def main():
    """Start the bot."""
    updater = Updater("1172370412:AAFjoR8RvgOQby1b0ZzZb9Y2smt3jZMMMKE",
                      # request_kwargs={'proxy_url': 'socks5://5.133.194.171:12951/'},
                      use_context=True)

    dp = updater.dispatcher
    dp.add_handler(CommandHandler("start", start))
    dp.add_handler(CommandHandler("help", help))
    dp.add_handler(MessageHandler(Filters.text, text))
    dp.add_error_handler(error)
    updater.start_polling()
    updater.idle()

if __name__ == '__main__':
    try:
        main()
    except KeyboardInterrupt:
        exit()

